liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
/****************************************************************************
* Title                 :   drive motor module
* Filename              :   drivemotor.c
* Author                :   Nekraus
* Origin Date           :   18/08/2022
* Version               :   1.0.0

*****************************************************************************/
/** \file drivemotor.c
 *  \brief drive motor module
 *
 */
/******************************************************************************
 * Includes
 *******************************************************************************/
#include <math.h>
#include <stdlib.h>
#include <string.h>

#include "stm32f_board_hal.h"

#include "adc.h"
#include "board.h"
#include "emergency.h"
#include "main.h"
#include "ros/ros_custom/cpp_main.h"

#include "drivemotor.h"

/******************************************************************************
 * Module Preprocessor Constants
 *******************************************************************************/
#define DRIVEMOTOR_LENGTH_INIT_MSG 38
#define DRIVEMOTOR_LENGTH_RQST_MSG 12
#define DRIVEMOTOR_LENGTH_RECEIVED_MSG 20

/* Kinematic ceiling on per-frame encoder motion. cmd_vel is capped to MAX_MPS,
 * so in one ~20 ms controller frame a wheel advances at most
 *   MAX_MPS * ticks_per_meter * 0.02 s  ticks.
 * The x3 factor is slack for frame-time jitter; a "reset" whose remainder
 * exceeds this is not real motion (a glitch) and is dropped, not accumulated.
 */
#define DRIVEMOTOR_MIN_TICKS_PER_M 50.0f
#define DRIVEMOTOR_MAX_TICKS_PER_M 5000.0f
/* Floor for the runtime max-speed cap. The CEILING is the compile-time MAX_MPS
 * (board.h / template) — the runtime value (PKT_ID_SET_KINEMATICS) can only
 * LOWER the motion cap, never raise it above the compiled safety limit. */
#define DRIVEMOTOR_MIN_MAX_MPS 0.1f
/* Controller replies follow 20 ms polls.  Three missed replies plus 15 ms
 * cooperative-loop slack is a link fault, not an invitation to reuse output. */
#define DRIVEMOTOR_FEEDBACK_TIMEOUT_MS 75u
/******************************************************************************
 * Module Preprocessor Macros
 *******************************************************************************/

/******************************************************************************
 * Module Typedefs
 *******************************************************************************/
typedef enum {
  DRIVEMOTOR_INIT_1,
  DRIVEMOTOR_INIT_2,
  DRIVEMOTOR_RUN,
  DRIVEMOTOR_BACKWARD,
  DRIVEMOTOR_WAIT
} DRIVEMOTOR_STATE_e;

typedef struct {
  /* 0*/ uint16_t u16_preambule;
  /* 2*/ uint8_t u8_length;
  /* 3*/ uint16_t u16_id;
  /* 5*/ uint8_t u8_direction;
  /* 6*/ uint8_t u8_left_speed;
  /* 7*/ uint8_t u8_right_speed;
  /* 8*/ uint16_t u16_ukndata0;
  /*10*/ uint8_t u8_left_power;
  /*11*/ uint8_t u8_right_power;
  /*12*/ uint8_t u8_error;
  /*13*/ uint16_t u16_left_ticks;
  /*15*/ uint16_t u16_right_ticks;
  /*17*/ uint8_t u8_left_ukn;
  /*18*/ uint8_t u8_right_ukn;
  /*19*/ uint8_t u8_CRC;
} __attribute__((__packed__)) DRIVEMOTORS_data_t;

/* Per-wheel travel-direction filter (see resolve_direction /
 * DRIVEMOTOR_App_Rx). Holds the last *confirmed* physical direction so the
 * motor controller's one-frame-early direction flip on a reversal cannot
 * mis-sign coast ticks. */
typedef struct {
  int8_t s8Eff;     /* committed/published travel direction (-1/0/+1)        */
  uint8_t u8Resets; /* counter resets counted during an unconfirmed reversal */
} DRIVEMOTOR_dirfilter_t;

/******************************************************************************
 * Module Variable Definitions
 *******************************************************************************/
UART_HandleTypeDef DRIVEMOTORS_USART_Handler; // UART  Handle

DMA_HandleTypeDef hdma_usart2_rx;
DMA_HandleTypeDef hdma_usart2_tx;

static DRIVEMOTOR_STATE_e drivemotor_eState = DRIVEMOTOR_INIT_1;
static rx_status_e drivemotors_eRxFlag = RX_WAIT;

/* DMA writes this buffer only.  The completion IRQ validates it then copies a
 * complete immutable snapshot; foreground never reads DMA memory. */
static DRIVEMOTORS_data_t drivemotor_dma_received = {0};
typedef struct {
  DRIVEMOTORS_data_t frame;
  uint32_t tick;
  uint32_t sequence;
  uint8_t valid;
  uint8_t controller_error;
} DRIVEMOTOR_snapshot_t;
static volatile DRIVEMOTOR_snapshot_t drivemotor_snapshot = {0};
static uint32_t drivemotor_consumed_sequence = 0;
static volatile uint32_t drivemotor_last_valid_tick = 0;
static volatile uint8_t drivemotor_seen_valid = 0;
static volatile uint8_t drivemotor_fault = 0;
static volatile uint8_t drivemotor_recover_rx = 0;
static volatile uint8_t drivemotor_rx_armed = 0;
static volatile uint32_t drivemotor_rx_started_tick = 0;
static uint8_t drivemotor_tx[2][DRIVEMOTOR_LENGTH_RQST_MSG];
static uint8_t drivemotor_tx_slot = 0;
static volatile uint8_t drivemotor_tx_busy = 0;
static volatile uint32_t drivemotor_tx_started_tick = 0;

const uint8_t drivemotor_pcu8Preamble[5] = {0x55, 0xAA, 0x10, 0x01, 0xE0};
// const uint8_t drivemotor_pcu8InitMsg[DRIVEMOTOR_LENGTH_INIT_MSG] = { 0x55,
// 0xaa, 0x08, 0x10, 0x80, 0xa0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x37};
const uint8_t drivemotor_pcu8InitMsg[DRIVEMOTOR_LENGTH_INIT_MSG] = {
    0x55, 0xaa, 0x22, 0x10, 0x80, 0x00, 0x00, 0x00, 0x00, 0x02,
    0xC8, 0x46, 0x0C, 0x00, 0x00, 0x00, 0x00, 0x05, 0x0F, 0x14,
    0x96, 0x0A, 0x1E, 0x5a, 0xfa, 0x05, 0x0A, 0x14, 0x32, 0x40,
    0x04, 0x20, 0x01, 0x00, 0x00, 0x2C, 0x01, 0xEE};

uint16_t prev_right_encoder_val = 0;
uint16_t prev_left_encoder_val = 0;
/* Last *confirmed* per-wheel direction + reset-bracket counters. Replaces the
 * old prev_*_direction / prev_*_wheel_speed_val edge-prediction fence, which
 * raced the controller's reset latency and mis-signed reversal coast ticks. */
static DRIVEMOTOR_dirfilter_t left_dir_filter = {0, 0};
static DRIVEMOTOR_dirfilter_t right_dir_filter = {0, 0};
uint32_t right_encoder_ticks = 0;
uint32_t left_encoder_ticks = 0;
int32_t right_ticks_signed =
    0; /**< Cumulative SIGNED encoder ticks (polarity = direction) */
int32_t left_ticks_signed = 0;
int8_t left_direction = 0;
int8_t right_direction = 0;
uint16_t right_encoder_val = 0;
uint16_t left_encoder_val = 0;
int16_t right_wheel_speed_val = 0;
int16_t left_wheel_speed_val = 0;
uint8_t right_power = 0;
uint8_t left_power = 0;

uint32_t DRIVEMOTOR_u32ErrorCnt = 0;
volatile float g_ticks_per_meter = (float)TICKS_PER_M;
/* Runtime max wheel-speed cap. Seeded with the compile-time MAX_MPS, which
 * therefore remains the power-on fallback AND the hard ceiling the wire cannot
 * exceed (see drivemotor_clamp_max_mps). Retunable via PKT_ID_SET_KINEMATICS. */
volatile float g_max_mps = (float)MAX_MPS;

