liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
static float drivemotor_clamp_ticks_per_meter(float ticks_per_meter) {
  if (!isfinite(ticks_per_meter) || ticks_per_meter <= 0.0f) {
    return (float)TICKS_PER_M;
  }
  if (ticks_per_meter < DRIVEMOTOR_MIN_TICKS_PER_M) {
    return DRIVEMOTOR_MIN_TICKS_PER_M;
  }
  if (ticks_per_meter > DRIVEMOTOR_MAX_TICKS_PER_M) {
    return DRIVEMOTOR_MAX_TICKS_PER_M;
  }
  return ticks_per_meter;
}

/* Clamp the runtime max-speed cap to (0, compile-time MAX_MPS]. An invalid or
 * unset value falls back to the compiled MAX_MPS; a value above it is capped to
 * it, so the wire can never raise the motion cap past the compiled ceiling. */
static float drivemotor_clamp_max_mps(float max_mps) {
  if (!isfinite(max_mps) || max_mps <= 0.0f) {
    return (float)MAX_MPS;
  }
  if (max_mps < DRIVEMOTOR_MIN_MAX_MPS) {
    return DRIVEMOTOR_MIN_MAX_MPS;
  }
  if (max_mps > (float)MAX_MPS) {
    return (float)MAX_MPS;
  }
  return max_mps;
}

static uint32_t drivemotor_max_ticks_per_frame(void) {
  const float ticks_per_meter =
      drivemotor_clamp_ticks_per_meter(g_ticks_per_meter);
  return (uint32_t)(drivemotor_clamp_max_mps(g_max_mps) * ticks_per_meter *
                    0.02f * 3.0f);
}

static uint8_t left_speed_req;
static uint8_t right_speed_req;
static uint8_t left_dir_req;
static uint8_t right_dir_req;

/* No host-side PWM deadband: the PAC5210 drive-motor controller runs its
 * own internal loop and handles sub-threshold commands gracefully (this
 * is how the original cedbossneo/mowgli firmware behaved, and it worked
 * fine). Adding a host-side deadband promotion on 2026-04-19 introduced
 * a 2.5× angular overshoot at low wz — any command between [-34, -1] ∪
 * [1, 34] got snapped to ±35, so wz=0.30 rad/s produced physical rotation
 * at ~0.72 rad/s. Confirmed in Voie C Test 2026-04-24 (commanded 90°
 * → measured 225° physical). The fix is to pass PWM through unchanged
 * and let the motor controller handle its own dynamics. */

/******************************************************************************
 * Function Prototypes
 *******************************************************************************/
__STATIC_INLINE void drivemotor_prepareMsg(uint8_t *msg, uint8_t left_speed,
                                           uint8_t right_speed,
                                           uint8_t left_dir, uint8_t right_dir);

static void drivemotor_recover_rx_if_needed(void) {
  const uint32_t now = HAL_GetTick();
  if (drivemotor_tx_busy &&
      (uint32_t)(now - drivemotor_tx_started_tick) >
          DRIVEMOTOR_FEEDBACK_TIMEOUT_MS) {
    /* A request still busy past the whole response deadline cannot safely
     * retain DMA ownership forever. Abort TX only after that bounded wait so
     * a normal in-flight zero command is never cut short. */
    drivemotor_fault = 1u;
    MOTORLINK_ForceInhibit();
    if (HAL_UART_AbortTransmit(&DRIVEMOTORS_USART_Handler) == HAL_OK) {
      drivemotor_tx_busy = 0u;
    }
  }
  if (drivemotor_rx_armed &&
      (uint32_t)(now - drivemotor_rx_started_tick) >
          DRIVEMOTOR_FEEDBACK_TIMEOUT_MS) {
    drivemotor_fault = 1u;
    MOTORLINK_ForceInhibit();
    drivemotor_recover_rx = 1u;
  }
  if (drivemotor_recover_rx) {
    /* Keep the request latched when HAL refuses the abort; a later foreground
     * pass retries instead of falsely claiming the DMA was rearmed. */
    if (HAL_UART_AbortReceive(&DRIVEMOTORS_USART_Handler) == HAL_OK) {
      drivemotor_rx_armed = 0u;
      drivemotor_recover_rx = 0u;
    }
  }
}

static void drivemotor_start_exchange(uint8_t *tx) {
  if (drivemotor_tx_busy || drivemotor_rx_armed || drivemotor_recover_rx) {
    return;
  }
  if (HAL_UART_Receive_DMA(&DRIVEMOTORS_USART_Handler,
                           (uint8_t *)&drivemotor_dma_received,
                           sizeof(drivemotor_dma_received)) != HAL_OK) {
    drivemotor_fault = 1u;
    MOTORLINK_ForceInhibit();
    drivemotor_recover_rx = 1u;
    return;
  }
  drivemotor_rx_armed = 1u;
  drivemotor_rx_started_tick = HAL_GetTick();
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  if (MOTORLINK_OutputInhibited()) {
    /* Close the race between preparing a non-zero frame and starting DMA. */
    drivemotor_prepareMsg(tx, 0, 0, 0, 0);
  }
  const HAL_StatusTypeDef tx_status =
      HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler, tx,
                            DRIVEMOTOR_LENGTH_RQST_MSG);
  if (tx_status == HAL_OK) {
    drivemotor_tx_slot ^= 1u;
    drivemotor_tx_busy = 1u;
    drivemotor_tx_started_tick = HAL_GetTick();
  } else {
    /* RX accepted but request TX did not: no reply can be expected. */
    drivemotor_fault = 1u;
    MOTORLINK_ForceInhibit();
    drivemotor_recover_rx = 1u;
  }
  if (primask == 0u) {
    __enable_irq();
  }
}

/******************************************************************************
 *  Public Functions
 *******************************************************************************/

/// @brief Initialize STM32 hardware UART to control drive motors
/// @param
void DRIVEMOTOR_Init(void) {
  PAC5210RESET_GPIO_CLK_ENABLE();
  GPIO_InitTypeDef GPIO_InitStruct;
  GPIO_InitStruct.Pin = PAC5210RESET_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(PAC5210RESET_GPIO_PORT, &GPIO_InitStruct);
  HAL_GPIO_WritePin(PAC5210RESET_GPIO_PORT, PAC5210RESET_PIN,
                    0); // take Drive Motor PAC out of reset if LOW

  // PD7 (->PAC5210 PC4), PD8 (->PAC5210 PC3)
  __HAL_RCC_GPIOD_CLK_ENABLE();
  GPIO_InitStruct.Pin = GPIO_PIN_7 | GPIO_PIN_8;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7 | GPIO_PIN_8, 1);

  // enable port and usart clocks
  DRIVEMOTORS_USART_GPIO_CLK_ENABLE();
  DRIVEMOTORS_USART_USART_CLK_ENABLE();

#if BOARD_YARDFORCE500_VARIANT_ORIG
  // RX
  GPIO_InitStruct.Pin = DRIVEMOTORS_USART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(DRIVEMOTORS_USART_RX_PORT, &GPIO_InitStruct);

  // TX
  GPIO_InitStruct.Pin = DRIVEMOTORS_USART_TX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(DRIVEMOTORS_USART_TX_PORT, &GPIO_InitStruct);

  // Alternate Pin Set ?
  __HAL_AFIO_REMAP_USART2_ENABLE();
#elif BOARD_YARDFORCE500_VARIANT_B
  // RX TX
  GPIO_InitStruct.Pin = DRIVEMOTORS_USART_TX_PIN | DRIVEMOTORS_USART_RX_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF7_USART2;
  HAL_GPIO_Init(DRIVEMOTORS_USART_TX_PORT, &GPIO_InitStruct);
#endif

