liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
  DRIVEMOTORS_USART_Handler.Instance = DRIVEMOTORS_USART_INSTANCE; // USART2
  DRIVEMOTORS_USART_Handler.Init.BaudRate = 115200;                // Baud rate
  DRIVEMOTORS_USART_Handler.Init.WordLength =
      UART_WORDLENGTH_8B; // The word is  8  Bit format
  DRIVEMOTORS_USART_Handler.Init.StopBits = USART_STOPBITS_1; // A stop bit
  DRIVEMOTORS_USART_Handler.Init.Parity = UART_PARITY_NONE;   // No parity bit
  DRIVEMOTORS_USART_Handler.Init.HwFlowCtl =
      UART_HWCONTROL_NONE; // No hardware flow control
  DRIVEMOTORS_USART_Handler.Init.Mode = USART_MODE_TX_RX; // Transceiver mode

  HAL_UART_Init(&DRIVEMOTORS_USART_Handler);

  /* USART2 DMA Init */
  /* USART2_RX Init */
#if BOARD_YARDFORCE500_VARIANT_ORIG
  hdma_usart2_rx.Instance = DMA1_Channel6;
#elif BOARD_YARDFORCE500_VARIANT_B
  hdma_usart2_rx.Instance = DMA1_Stream5;
  hdma_usart2_rx.Init.Channel = DMA_CHANNEL_4;
  hdma_usart2_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
  hdma_usart2_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_usart2_rx.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_usart2_rx.Init.MemInc = DMA_MINC_ENABLE;
  hdma_usart2_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_usart2_rx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_usart2_rx.Init.Mode = DMA_NORMAL;
  hdma_usart2_rx.Init.Priority = DMA_PRIORITY_LOW;
  if (HAL_DMA_Init(&hdma_usart2_rx) != HAL_OK) {
    Error_Handler();
  }

  __HAL_LINKDMA(&DRIVEMOTORS_USART_Handler, hdmarx, hdma_usart2_rx);

  // USART2_TX Init */
#if BOARD_YARDFORCE500_VARIANT_ORIG
  hdma_usart2_tx.Instance = DMA1_Channel7;
#elif BOARD_YARDFORCE500_VARIANT_B
  hdma_usart2_tx.Instance = DMA1_Stream6;
  hdma_usart2_tx.Init.Channel = DMA_CHANNEL_4;
  hdma_usart2_tx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
#endif
  hdma_usart2_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
  hdma_usart2_tx.Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_usart2_tx.Init.MemInc = DMA_MINC_ENABLE;
  hdma_usart2_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_usart2_tx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
  hdma_usart2_tx.Init.Mode = DMA_NORMAL;
  hdma_usart2_tx.Init.Priority = DMA_PRIORITY_HIGH;
  if (HAL_DMA_Init(&hdma_usart2_tx) != HAL_OK) {
    Error_Handler();
  }
  __HAL_LINKDMA(&DRIVEMOTORS_USART_Handler, hdmatx, hdma_usart2_tx);

  // enable IRQ
  HAL_NVIC_SetPriority(DRIVEMOTORS_USART_IRQ, 0, 0);
  HAL_NVIC_EnableIRQ(DRIVEMOTORS_USART_IRQ);

  __HAL_UART_ENABLE_IT(&DRIVEMOTORS_USART_Handler, UART_IT_TC);

  right_encoder_ticks = 0;
  left_encoder_ticks = 0;
  prev_right_encoder_val = 0;
  prev_left_encoder_val = 0;
  left_dir_filter = (DRIVEMOTOR_dirfilter_t){0, 0};
  right_dir_filter = (DRIVEMOTOR_dirfilter_t){0, 0};
}

/// @brief handle drive motor messages
/// @param
void DRIVEMOTOR_App_10ms(void) {

  static uint32_t l_u32Timestamp = 0;

  drivemotor_recover_rx_if_needed();
  switch (drivemotor_eState) {
  case DRIVEMOTOR_INIT_1:
    if (HAL_UART_Transmit_DMA(&DRIVEMOTORS_USART_Handler,
                              (uint8_t *)drivemotor_pcu8InitMsg,
                              DRIVEMOTOR_LENGTH_INIT_MSG) == HAL_OK) {
      drivemotor_tx_busy = 1u;
      drivemotor_tx_started_tick = HAL_GetTick();
      drivemotor_eState = DRIVEMOTOR_RUN;
      debug_printf(" * Drive Motor Controller initialization command queued\r\n");
    }
    break;

  case DRIVEMOTOR_RUN: {

    uint8_t *tx = drivemotor_tx[drivemotor_tx_slot ^ 1u];
    const bool feedback_healthy = DRIVEMOTOR_FeedbackHealthy();
    const bool output_allowed = feedback_healthy &&
                                !MOTORLINK_OutputInhibited();
    if (output_allowed) {
      drivemotor_prepareMsg(tx, left_speed_req, right_speed_req, left_dir_req,
                            right_dir_req);
    } else {
      /* The driver-level gate closes in the same foreground pass as an ISR
       * fault, without waiting for cpp_main to reset its control loops. */
      drivemotor_prepareMsg(tx, 0, 0, 0, 0);
    }

    /* todo add also accelerometer detection*/
    if (output_allowed &&
        (HALLSTOP_Left_Sense() || HALLSTOP_Right_Sense()) &&
        (left_dir_req || right_dir_req)) {

      switch (main_eOpenmowerStatus) {
      case OPENMOWER_STATUS_MOWING:
        /*hit something goes back */
        drivemotor_eState = DRIVEMOTOR_BACKWARD;
        l_u32Timestamp = HAL_GetTick();
        break;
      case OPENMOWER_STATUS_DOCKING:
        /* Get voltage from dock, stop the mower*/
        if (chargerInputVoltage > MIN_DOCKED_VOLTAGE) {
          drivemotor_prepareMsg(tx, 0, 0, 0, 0);
        } else { /*hit something goes back */
          drivemotor_eState = DRIVEMOTOR_BACKWARD;
          l_u32Timestamp = HAL_GetTick();
        }

        break;
      case OPENMOWER_STATUS_UNDOCKING:
      case OPENMOWER_STATUS_IDLE:
      case OPENMOWER_STATUS_RECORD:
      default:
        /* nothing to do in these modes*/
        break;
      }
    }

    drivemotor_start_exchange(tx);

    break;
  }

  case DRIVEMOTOR_BACKWARD:
    /* SAFETY: the collision auto-reverse drives the wheels open-loop at
     * 100 PWM. It must NEVER run while an emergency (e-stop button, wheel
     * lift, tilt, accelerometer, heartbeat-loss) is asserted. If emergency
     * fires mid-reverse, hard-stop the wheels this frame and abandon the
     * maneuver back to RUN (where cmd_vel drive is itself gated to 0 by the
     * hard_stop path in cpp_main). */
    if (Emergency_State() != 0 || !DRIVEMOTOR_FeedbackHealthy() ||
        MOTORLINK_OutputInhibited()) {
      drivemotor_prepareMsg(drivemotor_tx[drivemotor_tx_slot ^ 1u], 0, 0, 0, 0);
      drivemotor_eState = DRIVEMOTOR_RUN;
    } else {
      drivemotor_prepareMsg(drivemotor_tx[drivemotor_tx_slot ^ 1u], 100, 100, 0, 0); /* set to -0.33m/s  */
      if ((HAL_GetTick() - l_u32Timestamp) > 2000) {
        drivemotor_eState = DRIVEMOTOR_WAIT;
        l_u32Timestamp = HAL_GetTick();
      }
    }
    drivemotor_start_exchange(drivemotor_tx[drivemotor_tx_slot ^ 1u]);

    break;

  case DRIVEMOTOR_WAIT:
    drivemotor_prepareMsg(drivemotor_tx[drivemotor_tx_slot ^ 1u], 0, 0, 0, 0);
    drivemotor_start_exchange(drivemotor_tx[drivemotor_tx_slot ^ 1u]);

    /* SAFETY: bail out of the post-reverse settle immediately on emergency
     * so the state machine returns to the (emergency-gated) RUN state
     * instead of holding here. WAIT already commands 0, so this only shortens
     * the dwell — it never drives. */
    if (Emergency_State() != 0) {
      drivemotor_eState = DRIVEMOTOR_RUN;
    } else if ((HAL_GetTick() - l_u32Timestamp) > 1000) {
      drivemotor_eState = DRIVEMOTOR_RUN;
    }

    break;

  default:
    break;
  }

  /* TODO error management */
  switch (drivemotors_eRxFlag) {
  case RX_VALID:
    break;

  case RX_WAIT:

