liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
    /* todo check for timeout */

    break;

  case RX_CRC_ERROR:
  case RX_INVALID_ERROR:
  case RX_TIMEOUT_ERROR:
  default:
    /* inform for error */
    break;
  }
}

/// @brief Resolve the physical travel direction of a wheel for odometry.
///
/// The drive controller flips its reported direction bit one to two frames
/// BEFORE the wheel has actually reversed. For those frames it reports the new
/// direction with a speed byte of 0 while the wheel is really still coasting in
/// the OLD direction. Believing that bit feeds odometry a few ticks with the
/// wrong sign on every reversal (which here corrupts BOTH /wheel_odom and the
/// wheel-PI loop, since both consume left/right_ticks_signed).
///
/// So a reported reversal (opposite sign to the committed direction) is only
/// adopted once the new segment is confirmed by EITHER
///   (B) the reported speed byte going non-zero (controller now actively
///       driving the new direction), OR
///   (A) a second counter reset (the controller's documented double-reset that
///       brackets the real new segment).
/// Until then the previously committed direction keeps being reported. Resumes
/// in the same direction and the first motion from rest carry no stale motion
/// to mis-sign, so they are adopted immediately.
///
/// @param f         per-wheel filter state (updated in place)
/// @param reported  decoded reported direction this frame (-1/0/+1)
/// @param speed     reported speed byte this frame
/// @param reset     non-zero if the raw counter decreased this frame (a reset)
/// @return the committed (publishable) travel direction
static int8_t resolve_direction(DRIVEMOTOR_dirfilter_t *f, int8_t reported,
                                uint8_t speed, int reset) {
  if (reported != 0 && (speed != 0 || f->s8Eff == 0)) {
    /* (B) the speed byte confirms real motion in the reported direction -
     * or this is the first motion from rest, with no old direction to
     * protect. Either way, believe the reported direction immediately. */
    f->s8Eff = reported;
    f->u8Resets = 0;
  } else if (reported == -f->s8Eff) {
    /* Unconfirmed reversal: the controller reports the opposite direction
     * but the speed byte is still 0 while the wheel coasts the old way.
     * Keep the old direction until (A) a second counter reset confirms the
     * real new segment. (Frames here have speed 0, handled above first.) */
    if (reset && ++f->u8Resets >= 2) {
      f->s8Eff = reported;
      f->u8Resets = 0;
    }
  } else {
    /* stop report or same-direction frame: no reversal in progress */
    f->u8Resets = 0;
  }
  return f->s8Eff;
}

/// @brief Fold one controller frame into a wheel's tick totals + travel dir.
///
/// Rule 1 - detect the counter reset DIRECTLY: any decrease in the controller's
/// per-wheel counter means it reset to 0, so the progress since the reset is
/// the new value; otherwise the counter rose and we add the difference. (The
/// old code PREDICTED the reset from direction/speed edges and pre-synced
/// prev_*, which raced the controller's one-frame reset latency and scored the
/// pre-reset count as a phantom jump.) A reset whose remainder exceeds one
/// frame's kinematic limit is a glitch and is dropped rather than accumulated.
///
/// Rule 2 - the magnitude is signed by the CONFIRMED direction from
/// resolve_direction(), not the reported byte, so coast ticks on a reversal
/// keep the old sign until the wheel has truly turned around.
///
/// Accumulates both the legacy unsigned-abs counter (*ticks) and the signed
/// cumulative counter (*ticks_signed, consumed by the host + wheel-PI loop).
///
/// @return the committed (publishable) travel direction for this wheel.
static int8_t DRIVEMOTOR_UpdateWheel(DRIVEMOTOR_dirfilter_t *f, int8_t reported,
                                     uint8_t speed, uint16_t val,
                                     uint16_t *prev, uint32_t *ticks,
                                     int32_t *ticks_signed) {
  int32_t l_s32Delta = (int32_t)val - (int32_t)*prev;
  /* Confirmed travel direction for THIS frame's motion. */
  int8_t l_s8Eff = resolve_direction(f, reported, speed, l_s32Delta < 0);

  uint32_t l_u32Mag = 0;
  if (reported != 0) {
    if (l_s32Delta >= 0) {
      l_u32Mag = (uint32_t)l_s32Delta; /* progress within a segment */
    } else if ((uint32_t)val <= drivemotor_max_ticks_per_frame()) {
      l_u32Mag = (uint32_t)val; /* reset: new-segment progress so far */
    }
    /* else: implausibly large reset remainder => glitch, drop it */
  }
  *prev = val;
  *ticks += l_u32Mag; /* legacy unsigned-abs counter */
  *ticks_signed +=
      (int32_t)l_u32Mag * (int32_t)l_s8Eff; /* signed by CONFIRMED dir */
  return l_s8Eff;
}

/// @brief Decode received drive motor messages
/// @param
void DRIVEMOTOR_App_Rx(void) {
  DRIVEMOTOR_snapshot_t snapshot;
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  const uint32_t sequence = drivemotor_snapshot.sequence;
  if (sequence == drivemotor_consumed_sequence || !drivemotor_snapshot.valid) {
    __set_PRIMASK(primask);
    return;
  }
  snapshot = drivemotor_snapshot;
  __set_PRIMASK(primask);
  /* Mark only this immutable completion as consumed.  A newer ISR completion
   * has a different sequence and remains available for the next foreground pass. */
  drivemotor_consumed_sequence = sequence;
  if (snapshot.valid && !snapshot.controller_error) {
    const DRIVEMOTORS_data_t *frame = &snapshot.frame;
    /* decode */
    uint8_t direction = frame->u8_direction;
    // we need to adjust for direction (+/-) !
    if ((direction & 0xc0) == 0xc0) {
      left_direction = 1;
    } else if ((direction & 0x80) == 0x80) {
      left_direction = -1;
    } else {
      left_direction = 0;
    }
    if ((direction & 0x30) == 0x30) {
      right_direction = 1;
    } else if ((direction & 0x20) == 0x20) {
      right_direction = -1;
    } else {
      right_direction = 0;
    }

    left_encoder_val = frame->u16_left_ticks;
    right_encoder_val = frame->u16_right_ticks;

    // power consumption
    left_power = frame->u8_left_power;
    right_power = frame->u8_right_power;

