liltaket/mowglinext-f401-rm1000/firmware/stm32/ros_usbnode/src/drivemotor.c
    /*
     * Fold each wheel's controller frame into its tick totals and resolve
     * the true travel direction (DRIVEMOTOR_UpdateWheel / resolve_direction).
     * Reset detection is now DIRECT — any drop in the per-wheel counter is a
     * reset, so the new value is the post-reset progress (a glitch beyond one
     * frame's kinematic limit is dropped). The publishable direction is held
     * at the old sign through a reversal until the speed byte or a second
     * reset confirms the wheel has truly turned around, so the coast ticks
     * the controller emits one frame early are never mis-signed. This
     * replaces the old predict-the-reset fence + raw-direction signing, which
     * raced the controller's reset latency and corrupted left/right_ticks_
     * signed (and thus /wheel_odom + the wheel-PI loop) on every reversal.
     */
    int8_t l_s8EffLeftDir = DRIVEMOTOR_UpdateWheel(
        &left_dir_filter, left_direction,
        frame->u8_left_speed, left_encoder_val,
        &prev_left_encoder_val, &left_encoder_ticks, &left_ticks_signed);
    int8_t l_s8EffRightDir = DRIVEMOTOR_UpdateWheel(
        &right_dir_filter, right_direction,
        frame->u8_right_speed, right_encoder_val,
        &prev_right_encoder_val, &right_encoder_ticks, &right_ticks_signed);

    /* Sign the reported speed magnitude by the CONFIRMED direction too, so
     * the host's velocity sign agrees with the signed-tick trend. */
    left_wheel_speed_val =
        l_s8EffLeftDir * frame->u8_left_speed;
    right_wheel_speed_val =
        l_s8EffRightDir * frame->u8_right_speed;

    wheelTicks_handler(left_ticks_signed, right_ticks_signed,
                       left_wheel_speed_val, right_wheel_speed_val);

  }
}

void DRIVEMOTOR_SetTicksPerMeter(float ticks_per_meter) {
  g_ticks_per_meter = drivemotor_clamp_ticks_per_meter(ticks_per_meter);
}

float DRIVEMOTOR_GetTicksPerMeter(void) {
  return drivemotor_clamp_ticks_per_meter(g_ticks_per_meter);
}

void DRIVEMOTOR_SetMaxMps(float max_mps) {
  g_max_mps = drivemotor_clamp_max_mps(max_mps);
}

float DRIVEMOTOR_GetMaxMps(void) { return drivemotor_clamp_max_mps(g_max_mps); }

/**
 * @brief  Set drive motor speeds from a signed PWM command per wheel.
 *
 * Single scalar per wheel encodes both magnitude and direction: positive =
 * forward, negative = reverse, 0 = stop. The motor-controller PCB's legacy
 * (|speed|, direction-bit) interface is produced internally by this function.
 *
 * No host-side deadband: the PAC5210 motor controller handles sub-threshold
 * commands on its own. Saturates to 8-bit motor-controller magnitude range.
 *
 * @param  left_pwm_signed   signed PWM command for the left wheel
 * @param  right_pwm_signed  signed PWM command for the right wheel
 */
void DRIVEMOTOR_SetSpeedSigned(int16_t left_pwm_signed,
                               int16_t right_pwm_signed) {
  /* Saturate to the 8-bit motor-controller magnitude. */
  if (left_pwm_signed > 255)
    left_pwm_signed = 255;
  if (left_pwm_signed < -255)
    left_pwm_signed = -255;
  if (right_pwm_signed > 255)
    right_pwm_signed = 255;
  if (right_pwm_signed < -255)
    right_pwm_signed = -255;

  left_speed_req =
      (uint8_t)(left_pwm_signed < 0 ? -left_pwm_signed : left_pwm_signed);
  right_speed_req =
      (uint8_t)(right_pwm_signed < 0 ? -right_pwm_signed : right_pwm_signed);

  /* Motor-controller convention: dir=1 → forward at |speed|, dir=0 →
   * reverse at |speed| (or stop when |speed|=0). Only forward maps to
   * a non-zero dir byte. */
  left_dir_req = (left_pwm_signed > 0) ? 1 : 0;
  right_dir_req = (right_pwm_signed > 0) ? 1 : 0;
}

/**
 * @brief  Legacy 4-argument form kept as a thin shim over the signed API so
 *         any caller that still uses `(speed, speed, dir, dir)` keeps
 *         working. New code should call DRIVEMOTOR_SetSpeedSigned directly.
 */
void DRIVEMOTOR_SetSpeed(uint8_t left_speed, uint8_t right_speed,
                         uint8_t left_dir, uint8_t right_dir) {
  const int16_t l_signed =
      left_dir ? (int16_t)left_speed : -(int16_t)left_speed;
  const int16_t r_signed =
      right_dir ? (int16_t)right_speed : -(int16_t)right_speed;
  /* If both speeds are 0, the deadband path passes 0 through unchanged,
   * matching the old "0,0,0,0 == stop" contract. */
  DRIVEMOTOR_SetSpeedSigned((left_speed == 0) ? 0 : l_signed,
                            (right_speed == 0) ? 0 : r_signed);
}

/// @brief drive motor receive interrupt handler
/// @param
void DRIVEMOTOR_ReceiveIT(void) {
  /* IRQ owns the DMA buffer: validate, then publish one complete snapshot. */
  DRIVEMOTOR_snapshot_t next = {0};
  drivemotor_rx_armed = 0u;
  if (memcmp(drivemotor_pcu8Preamble, (uint8_t *)&drivemotor_dma_received,
             5) == 0) {
    uint8_t l_u8crc = crcCalc((uint8_t *)&drivemotor_dma_received,
                              DRIVEMOTOR_LENGTH_RECEIVED_MSG - 1);
    if (drivemotor_dma_received.u8_CRC == l_u8crc) {
      next.frame = drivemotor_dma_received;
      next.tick = HAL_GetTick();
      next.valid = 1u;
      next.controller_error = next.frame.u8_error != 0u;
      next.sequence = drivemotor_snapshot.sequence + 1u;
      drivemotor_snapshot = next;
      if (!next.controller_error) {
        drivemotor_last_valid_tick = next.tick;
        drivemotor_seen_valid = 1u;
        drivemotor_fault = 0u;
      } else {
        drivemotor_fault = 1u;
        MOTORLINK_ForceInhibit();
        DRIVEMOTOR_u32ErrorCnt++;
      }
      drivemotors_eRxFlag = RX_VALID;
    } else {
      drivemotor_fault = 1u;
      MOTORLINK_ForceInhibit();
      drivemotor_recover_rx = 1u;
      DRIVEMOTOR_u32ErrorCnt++;
      drivemotors_eRxFlag = RX_CRC_ERROR;
    }
  } else {
    drivemotor_fault = 1u;
    MOTORLINK_ForceInhibit();
    drivemotor_recover_rx = 1u;
    DRIVEMOTOR_u32ErrorCnt++;
    drivemotors_eRxFlag = RX_INVALID_ERROR;
  }
}

void DRIVEMOTOR_OnUartError(void) {
  drivemotor_fault = 1u;
  MOTORLINK_ForceInhibit();
  drivemotor_rx_armed = 0u;
  drivemotor_recover_rx = 1u;
  DRIVEMOTOR_u32ErrorCnt++;
}

void DRIVEMOTOR_OnTxComplete(void) { drivemotor_tx_busy = 0u; }

bool DRIVEMOTOR_FeedbackHealthy(void) {
  return drivemotor_seen_valid != 0u && drivemotor_fault == 0u &&
         (uint32_t)(HAL_GetTick() - drivemotor_last_valid_tick) <=
             DRIVEMOTOR_FEEDBACK_TIMEOUT_MS;
}

/******************************************************************************
 *  Private Functions
 *******************************************************************************/

__STATIC_INLINE void drivemotor_prepareMsg(uint8_t *drivemotor_pu8RqstMessage, uint8_t left_speed,
                                           uint8_t right_speed,
                                           uint8_t left_dir,
                                           uint8_t right_dir) {

  uint8_t direction = 0x0;

  // calc direction bits
  if (right_dir == 1) {
    direction |= (0x20 + 0x10);
  } else {
    direction |= 0x20;
  }
  if (left_dir == 1) {
    direction |= (0x40 + 0x80);
  } else {
    direction |= 0x80;
  }

  drivemotor_pu8RqstMessage[0] = 0x55;
  drivemotor_pu8RqstMessage[1] = 0xaa;
  drivemotor_pu8RqstMessage[2] = 0x08;
  drivemotor_pu8RqstMessage[3] = 0x10;
  drivemotor_pu8RqstMessage[4] = 0x80;
  drivemotor_pu8RqstMessage[5] = direction;
  drivemotor_pu8RqstMessage[6] = left_speed;
  drivemotor_pu8RqstMessage[7] = right_speed;
  drivemotor_pu8RqstMessage[9] = 0;
  drivemotor_pu8RqstMessage[8] = 0;
  drivemotor_pu8RqstMessage[10] = 0;
  drivemotor_pu8RqstMessage[11] =
      crcCalc(drivemotor_pu8RqstMessage, DRIVEMOTOR_LENGTH_RQST_MSG - 1);
}
